{
  "_name_or_path": "google/mobilebert-uncased",
  "architectures": [
    "MobileBertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_activation": false,
  "classifier_dropout": null,
  "embedding_size": 128,
  "hidden_act": "relu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 512,
  "id2label": {
    "0": "0",
    "1": "1",
    "10": "10",
    "100": "103",
    "101": "104",
    "102": "105",
    "103": "106",
    "104": "107",
    "105": "108",
    "106": "109",
    "107": "110",
    "11": "11",
    "12": "12",
    "13": "13",
    "14": "14",
    "15": "15",
    "16": "16",
    "17": "17",
    "18": "18",
    "19": "19",
    "2": "2",
    "20": "20",
    "21": "21",
    "22": "22",
    "23": "23",
    "24": "24",
    "25": "25",
    "26": "26",
    "27": "27",
    "28": "28",
    "29": "29",
    "3": "3",
    "30": "30",
    "31": "31",
    "32": "32",
    "33": "33",
    "34": "34",
    "35": "35",
    "36": "37",
    "37": "38",
    "38": "39",
    "39": "40",
    "4": "4",
    "40": "41",
    "41": "42",
    "42": "43",
    "43": "44",
    "44": "45",
    "45": "46",
    "46": "47",
    "47": "48",
    "48": "49",
    "49": "50",
    "5": "5",
    "50": "51",
    "51": "52",
    "52": "53",
    "53": "55",
    "54": "56",
    "55": "57",
    "56": "58",
    "57": "59",
    "58": "60",
    "59": "61",
    "6": "6",
    "60": "62",
    "61": "63",
    "62": "64",
    "63": "65",
    "64": "66",
    "65": "67",
    "66": "68",
    "67": "69",
    "68": "70",
    "69": "71",
    "7": "7",
    "70": "72",
    "71": "73",
    "72": "74",
    "73": "75",
    "74": "76",
    "75": "77",
    "76": "78",
    "77": "79",
    "78": "80",
    "79": "81",
    "8": "8",
    "80": "82",
    "81": "83",
    "82": "84",
    "83": "85",
    "84": "86",
    "85": "87",
    "86": "88",
    "87": "89",
    "88": "90",
    "89": "91",
    "9": "9",
    "90": "92",
    "91": "93",
    "92": "95",
    "93": "96",
    "94": "97",
    "95": "98",
    "96": "99",
    "97": "100",
    "98": "101",
    "99": "102"
  },
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "intra_bottleneck_size": 128,
  "key_query_shared_bottleneck": true,
  "label2id": {
    "0": 0,
    "1": 1,
    "10": 10,
    "100": 97,
    "101": 98,
    "102": 99,
    "103": 100,
    "104": 101,
    "105": 102,
    "106": 103,
    "107": 104,
    "108": 105,
    "109": 106,
    "11": 11,
    "110": 107,
    "12": 12,
    "13": 13,
    "14": 14,
    "15": 15,
    "16": 16,
    "17": 17,
    "18": 18,
    "19": 19,
    "2": 2,
    "20": 20,
    "21": 21,
    "22": 22,
    "23": 23,
    "24": 24,
    "25": 25,
    "26": 26,
    "27": 27,
    "28": 28,
    "29": 29,
    "3": 3,
    "30": 30,
    "31": 31,
    "32": 32,
    "33": 33,
    "34": 34,
    "35": 35,
    "37": 36,
    "38": 37,
    "39": 38,
    "4": 4,
    "40": 39,
    "41": 40,
    "42": 41,
    "43": 42,
    "44": 43,
    "45": 44,
    "46": 45,
    "47": 46,
    "48": 47,
    "49": 48,
    "5": 5,
    "50": 49,
    "51": 50,
    "52": 51,
    "53": 52,
    "55": 53,
    "56": 54,
    "57": 55,
    "58": 56,
    "59": 57,
    "6": 6,
    "60": 58,
    "61": 59,
    "62": 60,
    "63": 61,
    "64": 62,
    "65": 63,
    "66": 64,
    "67": 65,
    "68": 66,
    "69": 67,
    "7": 7,
    "70": 68,
    "71": 69,
    "72": 70,
    "73": 71,
    "74": 72,
    "75": 73,
    "76": 74,
    "77": 75,
    "78": 76,
    "79": 77,
    "8": 8,
    "80": 78,
    "81": 79,
    "82": 80,
    "83": 81,
    "84": 82,
    "85": 83,
    "86": 84,
    "87": 85,
    "88": 86,
    "89": 87,
    "9": 9,
    "90": 88,
    "91": 89,
    "92": 90,
    "93": 91,
    "95": 92,
    "96": 93,
    "97": 94,
    "98": 95,
    "99": 96
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "mobilebert",
  "normalization_type": "no_norm",
  "num_attention_heads": 4,
  "num_feedforward_networks": 4,
  "num_hidden_layers": 24,
  "pad_token_id": 0,
  "torch_dtype": "float32",
  "transformers_version": "4.47.0",
  "trigram_input": true,
  "true_hidden_size": 128,
  "type_vocab_size": 2,
  "use_bottleneck": true,
  "use_bottleneck_attention": false,
  "vocab_size": 30522
}
